<?php

use Illuminate\Database\Seeder;

class SettingsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('settings')->insert([
            [
                'name' => 'website_name',
                'value' => 'سوق نشمي'
            ],
            [
                'name' => 'website_description',
                'value' => 'سوق نشمي هو واحد من أهم روّاد المواقع الإلكترونية المتخصصة في مجال الإعلانات المبوبة والتي تمكّن المستخدمين سواء كانوا بائعين أم مشترين من بيع وشراء مختلف السلع والمنتجات والخدمات خلال أقصر وقت ممكن وبأقل جهد يُذكر، وسواء كانت حالة تلك المنتجات جديدة أم مستعملة. وحتى يسهل على المستخدم إيجاد ما يبحث عنه أو الإعلان عمّا يريد بيعه يوجد أقسام رئيسية وفرعية لعرض وتصفّح مختلف أنواع السلع والخدمات المتداولة بينهم وإتاحة التواصل المباشر فيما بينهم بكل سهولة.'
            ],
            [
                'name' => 'email',
                'value' => 'info@app_name.net'
            ],
            [
                'name' => 'phone',
                'value' => '+201000000000'
            ],
            [
                'name' => 'phone2',
                'value' => '+201000000000'
            ],
            [
                'name' => 'facebook',
                'value' => 'https://www.facebook.com'
            ],
            [
                'name' => 'twitter',
                'value' => 'https://www.twitter.com'
            ],
            [
                'name' => 'instagram',
                'value' => 'https://www.instagram.com'
            ],
            [
                'name' => 'youtube',
                'value' => 'https://www.youtube.com'
            ],
            [
                'name' => 'linkedin',
                'value' => 'https://www.linkedin.com'
            ],
            [
                'name' => "privacy",
                'value' => "<p>هذه الاتفاقيه تبين سياسة الخصوصية لسوق نشمي وذلك  فيما يختص بجمع واستخدام وتخزين ومشاركة وحماية المعلومات الشخصية الخاصة بالمستخدم، وهذه السياسه الخاصه بشركة حلول نعم لتقنية المعلومات َوماتملك من مواقع اللكترونيه وتطبيقات وخدمات ومنها سوق نشمي بغض النظر عن طريقة الوصول إلى هذه الخدمات بما في ذلك الأجهزة المحمولة. <br>

·         بنود الإتفاقية: عند استخدامك لسوق نشمي وأي من الخدمات ذات الصلة، فأنت تمنح الموقع موافقة صريحة على جمع واستخدام والإحتفاظ بمعلوماتك الشخصية، وذلك كما هو موضح في سياسة الخصوصية وشروط الاستخدام الخاصة بسوق نشمي <br>

تتيح لك شركة حلول نعم البحث في سوق نشمي  بدون القيام بتسجيل حساب شخصي. وعندما تقرر تزويد الموقع بمعلوماتك الشخصية، فإنك توافق على أن يتم إرسال هذه المعلومات وتخزينها في الخوادم الخاصة به. <br>

عند استخدامك ايا من مواقع وتطبيقات شركة حلول نعم بما فيها سوق نشمي فأن الخدمات التي يقدمها لك الموقع أو للمستخدمين بشكل عام أو الردّ على الإعلانات أو غير ذلك من المحتوى الموجود، سيقوم الموقع بجمع المعلومات المرسلة من جهازك تلقائياً سواء كان كمبيوتراً أم هاتفاً محمولاً أم غير ذلك. وتشمل هذه المعلومات ما يلي: <br>

·         المعلومات التي تمّ جمعها الموقع  من خلال تفاعلك على الموقع  بالبريد الالكتروني او الشات الداخلي والتي تشمل: رقم الجهاز، نوع الجهاز، معلومات موقعك الجغرافي، معلومات الإتصال بشبكة الإنترنت، إحصائيات عرض الصفحات، الزيارات من وإلى الموقع، الروابط المترجعة، بيانات الإعلان، عنوان البروتوكول ومعلومات الدخول لشبكة الإنترنت. <br>

·         المعلومات التي يجمعها الموقع من خلال ملفات الكوكيز  مشغلات الإنترنت  <br>

 نحن نجمع معلومات  تقوم أنت بإدخالها على الموقع أو البيانات التي تقدمها عند استخدامك لأي من خدماتنا. وتلك المعلومات مثل..  <br>

·         المعلومات التي تقدمها لسوق نشمي عند التسجيل  <br>

·         المعلومات المرتبطه بالخدمات التي تقدمها  لسوق نشمي من خلال منصات الإعلام الاجتماعية  أو خدمات الطرف الثالث والتي سننوه عنها لاحقا <br>

·       

·         المعلومات الخاصة بموقعك الجغرافي وموقع جهازك وتضم؛ معرف المعلومات الخاص بك ما إذا كنت قد فعلت هذه الخدمة على هاتفك المحمول من قبل. <br>

وقد يحتاج سوق نشمي  لجمع  معلومات إضافية عنك من خلال الأطراف الثالثة وإضافتها إلى معلومات حسابك. هذه المعلومات تضم: البيانات الديموغرافية، بيانات الملاحة، بيانات الإتصال والبيانات الإضافية عنك من مصادر أخرى مثل السلطات العامة إلى الحد الذي يسمح به القانون. <br>

 موافقتك علي سياسة. الخصوصيه تتيح لسوق نشمي جمع معلوماتك للاسباب الاتيه: <br>

·         لتمكينك من الوصول إلى خدماته المتنوعة وخدمة العملاء عن طريق البريد الإلكتروني أو رقم الهاتف <br>

·         للمنع والكشف عن والتحقيق عند وجود إحتمالية لأنشطة محظورة فيها احتيال ومخالفة للقانون وعدم التقيّد بشروط استخدام موقع سوق نشمي <br>

·         لتحسين الخدمات المقدمه لك من سوق نشمي <br>

·         للتواصل معك عن طريق البريد الإلكتروني، التنبيهات، الرسائل النصية أو الهاتف للاستفسار عن خدمات سوق نشمي  لأغراض التسويق والتحديثات والعروض الاعلانيه <br>

  خدمات  سوق نشمي تمكنك من  الوصول إلى الموقع أو المواقع ذات الصلة باعتماد تسجيل الدخول الخاص بك. ونقدم لك خدمات تمكنك من مشاركة معلوماتك الموجودة على مواقع التواصل الاجتماعي (الطرف الثالث)، مثل فيسبوك، انستجرام  جوجل بلس، تويتر وغيرها. <br>

 عند تمكينك سوق نشمي من الوصول إلى معلوماتك الشخصية الموجودة على أي من مواقع الطرف الثالث، فإن إطار الوصول هذا يتم تحديده من قبل إعدادات المتصفح الخاص بك وموافقتك علىه. وإذا كنت ترغب بوصل حسابك على سوق نشمي بحسابك على أي طرف ثالث فأنت بذلك توافق على جمع واستخدام وتخزين معلوماتك الشخصية حسب اتفاقية المستخدم <br>

  معلوماتك الشخصية التي قد يتم الافصاح عنها  لأطراف ثالثة وفقاً لسياسة الخصوصية  والقوانين المعمول بها في بلدك.  <br>

·         شركاء سوق نشمي لتقديم خدماته على شبكة الإنترنت، مثل: مقدمي الخدمات المالية، وكالات التسويق والدعم التقني. وفي مثل هذه الحالات تبقى معلوماتك الشخصية تحت سيطرة شركة حلول نعم لتقنية المعلومات <br>

الشرطه والقضاء والجهات التنظيميه إذا طلبت من سوق نشمي بالإفصاح عنها بموجب القانون المعمول به في بلدك. <br>

    تنفيذا لامر قانوني أو أمر صادر من المحكمة <br>

      إذا كان ذلك ضرورياً لمنع وكشف او الحماية من الجرائم الجنائية، مثل النصب والاحتيال والدعاوى القضائية <br>

   إذا كان ذلك يمس سياسة الخصوصيه أو لحماية حقوق الآخرين وحرياتهم. <br>

·         أطراف ثالثة أخرى قمت بإعطاء الموافقة على مشاركة معلوماتك الشخصية معها من خلالنا على سبيل التعاون المشترك <br>
 
يتيح موقع سوق نشمي لمستخدميه بمشاركة الإعلانات وغيرها من المعلومات مع مستخدمين آخرين، ممّا يجعلها في متناول أيديهم. وبما أن الموقع يسمح أيضاً بالتواصل المباشر مع أي بائع أو مشتري فستكون  أنت المسؤول عن ذلك؛ إذ أن الموقع لا يضمن خصوصية أو أمن المعلومات التي تشاركها مع المستخدمين الآخرين. <br>

وبناءا عليه فإنت توافق على إحتمالية استخدام الموقع للمعلومات التي تم جمعها لإرسال العروض المتوفرة لك، سواء كانت شخصية أم لا، أو الاتصال بك عن طريق رقم الهاتف وذلك فيما يتعلق بالمنتجات أو الخدمات التي يقدمها سوق نشمي <br>

ولن يقوم الموقع ببيع أو تأجير معلوماتك الشخصية  مثل لأطراف ثالثة لأغراض التسويق الخاصة بهم بدون موافقتك الصريحة والتي تتمثل بزيارتك للموقع أو إستخدام التطبيقات الخاصة به. وقد يجمع سوق نشمي معلوماتك مع معلومات أخرى تم جمعها من شركات أخرى لاستخدامها في تحسين وتخصيص الخدمات والوظائف. <br>

كمستخدم لسوق نشمي؛ فإنت ومقدمي الخدمات كذلك يقوموا بوضع ملفات الكوكيز (ملفات البيانات الموجودة على الهاتف الخاص بك أو المحرك) أو مشغلات الويب (الصور الإلكترونية التي يتم وضعها في كود صفحة الإنترنت) أو التقنيات المشابهة. ويستخدم ونحن في سوق نشمي نستخدم ملفات الكوكيز هذه للتعرف عليك كمستخدم ليوفر لك خدمه جيده من خلال موقعه على الإنترنت  <br>

يمكنك تعديل المعلومات الخاصة بك عن طريق تسجيل الدخول إلى حسابك الخاص على سوق نشمي.  <br>

يهمنا الحفاظ علي  معلوماتك الخاصة  في سوق نشمي باستخدام تدابير أمنية وتقنية معتمده(مثل: جدران الحماية Firewall، تشفير البيانات وضوابط الوصول الي الخوادم والتي بدورها تحد من مخاطر الخسارة وسوء المعاملة والوصول غير المصرّح به، والكشف عن المعلومات وتغييرها. وبالرغم من ذلك، إذا كنت تعتقد بأن هنالك من يستخدم حسابك الشخصي بشكل سيء، يرجى التواصل مع خدمة العملاء. <br>

الرسائل الوهميه والإتصالات التجارية غير المرغوب فيها ('البريد الوهمي'): لن نتواني في اتخاذ الاجراءات القانونيه مع من يسيء استخدام موقعه على شبكة الإنترنت. وكمستخدم فإنه غير مصرّح لك بإضافة مستخدمي الموقع الآخرين إلى قائمة بريدك (الإلكتروني أو العادي) لأغراض تجارية حتى وإن كان أحدهم قد قام بشراء شيء منك مسبقاً، ما لم تحصل على موافقته الصريحة. وفي حال لاحظت بأن هنالك من يسيؤون استخدام الموقع (على البريد الوهمي) يرجى إعلامنا عن طريق التواصل مع خدمة العملاء. <br>

الأطراف الثالثة: ما لم تنص سياسة الخصوصية هذه على تقديم المعلومات من هذه الأطراف بطرق أخرى، فإنها تنطبق فقط على استخدام ونقل المعلومات التي يقوم الموقع بجمعها عنك. ولا يمتلك الموقع حق التحكم بسياسات الخصوصية للأطراف الثالثة التي تنطبق عليك. <br>

قد يتطلب الامر في سوق نشمي تغيير  سياسة الخصوصية  من وقت لآخر، لذا ننصحك بقراءتها بشكل منتظم، وعند حدوث أي تغييرات جوهرية عليها سيتم إعلان ذلك على الموقع، ويتم تفعيل النسخة المعدلة من سياسة الخصوصية على موقع سوق نشمي <br></p>",
            ],
            [
                'name' => "terms",
                'value' => '<p>عند استخدامك موقع سوق نشمي فأنت تقر أنك قرأت وعن اقتناع بموافقتك ضمنيا علي شروط الاستخدام. <br>
                    ١-القبول بشروط الاعلان:- <br>
                    -ممنوع الاعلانات التي تخالف الدين الاسلامي او التي تتعرض للاديان الاخري او معتقدات الاخرين. <br>
                    -موقع سوق نشمي يعمل في جميع الوطن العربي ويجب عليك الالتزام بعدم مخالفة قوانين البلد التي تنشر اعلانك فيها والالتزام بالقوانين والاعراف الساريه في البلدان العربيه.. <br>
                    ٢-الاعلانات الممنوعه في سوق نشمي ويجب الالتزام بها:- <br>
                    -ممنوع الاعلان عن الاسلحه والذخائر. <br>
                    -ممنوع الاعلانات الجنسيه بالصور او الوصف او خلافه. <br>
                    -ممنوع الاعلان عن الادويه او المخدرات او المهدئات او المشروبات الكحوليه. <br>
                    -ممنوع الاعلان عن مراكز المساج او الخدمات الخاصه. <br>
                    -ممنوع الاعلان عن كل مايخص الجيش او الشرطه سواء ملابس او شارات او وسائل دفاعيه. <br>
                    -ممنوع الاعلان عن المشاريع الوهميه او التسويق الهرمي <br>
                    ٣-الموقع متاح للاستخدام من قبل الجميع حتي لو كنت زائرا. <br>
                    لذلك جميع الاعلانات هي مسئولية المعلن و سوق نشمي غير مسئول عن مضمون الاعلانات او نتائجها ويحق لادارة سوق نشمي حذف الاعلان اذا رأينا انه ينتهك سياسة الاستخداَم او يحتوي علي منتج وهمي يضلل المشترين. <br>
                    ٤-سوق نشمي ليس مسئولا عن اي اعلان مخالف او مضلل او يحتوي علي روابط مسيئه او احتياليه ويحق له منع المعلن من الاعلان في الموقع. <br>
                    سوق نشمي منصه الكترونيه يتيح التواصل بين البائع والمشتري عن طريق المحادثه الداخليه او الرسائل. لذلك سوق نشمي غير مسئول عن الاضرار المباشره او غير المباشره المتعلقه بالارباح او الخساره او البيانات او اي خسائر اخري ناتجه عن سوء استخدام خدماتنا ومن جهتنا ننصح بالحرص علي عدم تحويل اي اموال الا بعد استلام مشترياتك بالطرق القانونيه. <br>
                    ٥-شركة حلول نعم لتقنية المعلومات المالكه لموقع سوق نشمي تحتفظ بحقوق الملكيه الخاصه لموقع سوق نشمي ومايحتويه من صور ومستندات وبيانات واي انتهاك لحقوق الملكيه سيؤدي للمتابعه القضائيه في ارجاء الوطن العربي. <br>
                    ٦-تحتفظ شركة حلول نعم المالكه لموقع سوق نشمي بالحق في تعديل شروط هذه الاتفاقيه في اي وقت دون الرجوع الي المستخدم وسيتم نشر اي تعديل في حينه علي الموقع.</p>'
            ],
            [
                'name' => 'about',
                'value' => "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع. <br>
ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق.
هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً. <br> <br>

هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع. <br>
ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق.
هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً. <br> <br>

هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع. <br>
ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق.
هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً. <br> <br>

هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع. <br>
ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق.
هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً. <br> <br>

هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.
إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع. <br>
ومن هنا وجب على المصمم أن يضع نصوصا مؤقتة على التصميم ليظهر للعميل الشكل كاملاً،دور مولد النص العربى أن يوفر على المصمم عناء البحث عن نص بديل لا علاقة له بالموضوع الذى يتحدث عنه التصميم فيظهر بشكل لا يليق.
هذا النص يمكن أن يتم تركيبه على أي تصميم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً."
            ],
            [
                'name' => 'safety',
                'value' => '<p>إقرأ نصائح السلامة الآتية لتتمكّن من استخدام موقعنا بأمان</p>
                <div class="inner">
                <div class="rel">
                <h3>كيف يمكنني إتمام عملية البيع بأمان؟</h3>
                </div>
                <ul>
                <li>أعلم المشتري بأي عيوب في السلعة، وذلك تجنباً لأن يتهمك بالخداع</li>
                <li>إتّفق مع المشتري على استخدام وسائل الدفع المألوفة والسهلة، ونحن نُفضّل الدفع نقداً</li>
                <li>لا تُشارك أبداً معلوماتك أو بياناتك شخصية، وتحديداً تلك المتعلّقة بحسابك المصرفي</li>
                <li>يرجى عدم إضافة عنوان إيميلك داخل الوصف وذلك لحماية خصوصيتك</li>
                <li>في حال استمرّ المشتري في تغيير مكان اللقاء أو يُهاتفك من رقم مختلف في كلّ مرة، تجنّب التعامل معه</li>
                <li>حرصاً منّا على سلامتك، إذا بقي المشتري جالساً في سيارته، يُفضّل أن تطلب منه أن يترجل لتفقد السلعة في مكان اللقاء</li>
                </ul>
                </div>
                <p class="intro x-large lheight24 tcenter">&nbsp;</p>
                <div class="inner">
                <div class="rel">
                <h3>كيف يمكنني إتمام عملية الشراء بأمان؟</h3>
                </div>
                <ul>
                <li>إحرص على لقاء البائع في مناطق آمنة على غرار محطة المترو أو مراكز التسوق أو أي مكان عام</li>
                <li>تفقّد السلعة قبل إتمام الصفقة، إذ تتمكن بهذه الطريقة من تجنب الغش والاحتيال. ينطبق هذا أيضاً على استئجار الوحدات السكنية</li>
                <li>ثق بحدسك واحذر العروض غير الواقعية، مثلاً إن لاحظت أنّ الصفقة مغرية جداً، فعلى الأرجح أنّها عبارة عن محاولة احتيال</li>
                <li>لا تقع في فخ الأسعار الأدنى مما هي في العادة. قارن الأسعار المعروضة مع الأسعار الموجودة في السوق</li>
                <li>لا تتعامل مع البائعين الذين يصرّون على معرفة معلومات شخصية عنك، مثلاً عمرك وحسابك المصرفي</li>
                <li>لا ترسل أبداً دفعة جزئية أو كاملة مسبقاً، أو تستخدم بطاقة ائتمانية للدفع قبل استلام سلعتك</li>
                <li>وتذكّر هذه القاعدة الذهبية، إحرص على إتمام الصفقة وجهاً إلى وجه مع البائع</li>
                </ul>
                </div>
                <p class="intro x-large lheight24 tcenter">&nbsp;</p>
                <div class="inner">
                <div class="rel">
                <h3>كيف يمكنني الحفاظ على أمان حسابي على؟</h3>
                </div>
                <p>لا تُشارك معلومات تسجيل الدخول إلى حسابك مع أحد. إختر كلمة سرّ صعبة، تتألّف من 6 حروف وأرقام وعلامات ترقيم على الأقلّ. لضمان حمايتك، لا تختر ميزة حفظ كلمة السر في متصفح الويب. إذا لاحظت أنّ أحداً يعرف كلمة السر الخاصة بك، سارع إلى تغييرها. إليك بعض الإجراءات الوقائية الإضافية...</p>
                <ul>
                <li>تنبّه إن كان سعر السلعة منخفضاً للغاية مقارنة بسعرها المعروض في السوق</li>
                <li>تجنّب التعامل مع بائع/مشتري يرفض إتمام الصفقة وجهاً إلى وجه أو الدفع عند الاستلام</li>
                <li>إبق متيقظاً عند التعامل مع مستخدم أنشأ حسابه مؤخراً على سوق نشمي</li>
                </ul>
                <p>&nbsp;</p>
                <div class="inner">
                <div class="rel">
                <h3>ماذا يجب أن أفعل في حال شككت بمصداقية إعلان أحد المستخدمين؟</h3>
                </div>
                <p>يرجى&nbsp;<a href="../contact" target="_blank">التواصل معنا</a>&nbsp;فوراً، في حال شككت بمصداقية إعلان أحد المستخدمين على أوليكس. بالإضافة إلى ذلك، نحثّك على التوجه إلى الشرطة إن وقعت في فخ الاحتيال. نحن مستعدون لتزويد الشرطة بأي معلومات تخدم التحقيق، بناءً على طلب رسمي منهم. سارع إلى تعبئة طلب لنتمكن من إيقاف حساب الشخص بعد القيام بالتحرّيات اللازمة</p>
                </div>'
            ],
            [
                'name' => 'latitude',
                'value' => '30.0596185'
            ],
            [
                'name' => 'longitude',
                'value' => '31.1884238'
            ],
            [
                'name' => 'slogan',
                'value' => 'بيع و أشترى و أجر بضغطة زر واحدة'
            ],
            [
                'name' => 'notification',
                'value' => '( دعاء دخول السوق )
لا إله إلا الله وحده لا شريك له، له الملك وله الحمد يحيي ويميت وهو حي لا يموت، بيده الخير كله وهو على كل شيء قدير.'
            ],
            [
                'name' => 'open_store_section_header',
                'value' => 'تواصل مع عملائك بإحترافية تامة'
            ],
            [
                'name' => 'open_store_section',
                'value' => 'قم بانشاء متجرك الخاص على سوق نشمي بخطوات سهلة و سريعة و أعرض منتجاتك بشكل احترافي لتنال ثقة العملاء , يمكنك تخصيص متجرك بشكل كامل و تحديد شعار و بانر للمتجر و ستتمكن من عرض كافة منتجاتك في الصفحة الخاصة بمتجرك بشكل جذاب'
            ],
            [
                'name' => 'advertize',
                'value' => '<p style="text-align: right;">للإعلان معنا برجاء التواصل ع الارقام الموضحة بالأسفل</p>
<hr />
<p style="text-align: right;"><strong><em><br />من داخل مصر</em></strong></p>
<p style="text-align: right;">01000000000<br />01000000000</p>
<hr />
<p style="text-align: right;"><strong><em><br />من داخل المملكة العربية السعودية</em></strong></p>
<p style="text-align: right;">0120000000<br />0110000000</p>
<hr />
'
            ],
            [
                'name' => 'balance',
                'value' => '<p style="text-align: right;">لشحن محفظتك برجاء التواصل ع الارقام الموضحة بالأسفل</p>
<hr />
<p style="text-align: right;"><strong><em><br />من داخل مصر</em></strong></p>
<p style="text-align: right;">01000000000<br />01000000000</p>
<hr />
<p style="text-align: right;"><strong><em><br />من داخل المملكة العربية السعودية</em></strong></p>
<p style="text-align: right;">0120000000<br />0110000000</p>
<hr />'
            ],
            [
                'name' => 'featured_ads_benefits',
                'value' => 'قم بانشاء متجرك الخاص على سوق نشمي بخطوات سهلة و سريعة و أعرض منتجاتك بشكل احترافي لتنال ثقة العملاء , يمكنك تخصيص متجرك بشكل كامل و تحديد شعار و بانر للمتجر و ستتمكن من عرض كافة منتجاتك في الصفحة الخاصة بمتجرك بشكل جذاب'
            ],
            [
                'name' => 'featured_ads_benefits',
                'value' => 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق'
            ],
            [
                'name' => 'tier3',
                'value' => '1'
            ],
            [
                'name' => 'tier4',
                'value' => '2'
            ],
            [
                'name' => 'tier5',
                'value' => '3'
            ],
            [
                'name' => 'tier9',
                'value' => '29'
            ],
            [
                'name' => 'tier10',
                'value' => '50'
            ],
            [
                'name' => 'tier11',
                'value' => '69'
            ],
            [
                'name' => 'tier12',
                'value' => '79'
            ],
            [
                'name' => 'tier13',
                'value' => '89'
            ],
            [
                'name' => 'tier14',
                'value' => '99'
            ],
            [
                'name' => 'tier5',
                'value' => '3'
            ],
    	]);
    }
}
